# StructuralSectionCommonMomentOfInertiaStrongAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonMomentOfInertiaStrongAxis Property
ParameterTypeId Class See Also
---
"Moment of Inertia strong axis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonMomentOfInertiaStrongAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonMomentOfInertiaStrongAxis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonMomentOfInertiaStrongAxis {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace